#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.KEYCLOAK_DEV.module.moh_applications.module.FMDB.module.payara_client.keycloak_openid_client.CLIENT: Refreshing state... [id=db9dd8ab-0f38-4471-b396-e2ddac45a001]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.DMFT-SERVICE: Refreshing state... [id=2fa5ed3f-39bd-4f67-84be-b1053bec576e]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.PIDP-SERVICE: Refreshing state... [id=f2d7cc73-3c77-44e0-b6fb-cec2ea545629]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_openid_client.CLIENT: Refreshing state... [id=38c5393f-a736-4ee3-a952-477e3308f802]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.DMFT-WEBAPP: Refreshing state... [id=837e901e-963a-480d-b427-764af3beb491]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.USER-MANAGEMENT: Refreshing state... [id=0ac8e30e-28cb-4545-bd7f-dc4a195661b2]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.realm-management: Refreshing state... [id=1b2ce61a-1235-4a0e-8334-1ac557151757]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.USER-MANAGEMENT-SERVICE: Refreshing state... [id=2ddc7173-34f3-41ff-9beb-66c7802717ce]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client.UCI-SSO: Refreshing state... [id=d437e64b-61cb-4e44-a5e3-87b7ae925582]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_query-groups: Refreshing state... [id=bd9c60ca-63fa-4bf8-ab51-935ae4ca0d12]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_query-clients: Refreshing state... [id=644d3737-bff6-419d-97c5-fef873aa2483]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_manage-users: Refreshing state... [id=f3622592-630f-490c-82c0-f7fb1d3cd4d1]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_query-users: Refreshing state... [id=dc7a93f3-671d-45dc-a813-d6a0f3e9ee00]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_VAN_COSTL"]: Refreshing state... [id=90fa0a65-a5be-4251-8a1c-9cba5cadffcb]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_view-events: Refreshing state... [id=e7803d5a-b7e1-48bc-b8cb-f465c3a09e11]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper: Refreshing state... [id=588babd9-d333-4297-996e-2f833c770b1e]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_INTERIOR"]: Refreshing state... [id=b9a23738-1014-4fa2-94ec-201ce3b0996f]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_PHSA"]: Refreshing state... [id=129bdc5b-640f-4d09-9277-0bcd0bfd0f35]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMSTAFF"]: Refreshing state... [id=7d39b603-a372-479c-9d78-6dd5065e75d4]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_FRASER"]: Refreshing state... [id=f09e0aab-de32-4ac1-8d74-b5ee97a2413a]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMADMIN"]: Refreshing state... [id=349a5c19-13b2-4b3d-b0d2-659f5dba0aa2]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.keycloak_openid_user_session_note_protocol_mapper.IDP: Refreshing state... [id=c3e8dcc6-ef1a-48d8-bd39-3ade2bd26f3b]
module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_NORTHERN"]: Refreshing state... [id=a052ab78-a360-4d35-b2a0-64be9d74b2d4]
module.KEYCLOAK_DEV.module.moh_applications.module.FMDB.module.payara_client.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper: Refreshing state... [id=9310c16a-52f2-431b-b3f2-135196796c89]
module.KEYCLOAK_DEV.module.moh_applications.module.FMDB.module.payara_client.keycloak_role.ROLES["MOHUSER"]: Refreshing state... [id=94fc2570-c6df-4b46-b734-ac2a6c8c5916]
module.KEYCLOAK_DEV.module.moh_applications.module.FMDB.module.payara_client.keycloak_role.ROLES["PSDADMIN"]: Refreshing state... [id=a88f491a-3bd1-46ce-9cf6-c509f9a916f8]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UCIROLE: Refreshing state... [id=551bc722-0068-4fa6-b3ab-8886fe40d685]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_default_scopes.USER-MANAGEMENT: Refreshing state... [id=moh_applications/0ac8e30e-28cb-4545-bd7f-dc4a195661b2]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.USER-MANAGEMENT_role_user-management-admin: Refreshing state... [id=4976c7c5-fc66-4cb2-8052-ed757bc60b45]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_optional_scopes.USER-MANAGEMENT: Refreshing state... [id=moh_applications/0ac8e30e-28cb-4545-bd7f-dc4a195661b2]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_view-clients: Refreshing state... [id=25f8cbcd-74fa-4f55-bfc7-2e6bbcbe84ad]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.realm-management_role_view-users: Refreshing state... [id=d50255df-43b4-4b05-9439-72c953ecbbda]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_query-users_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/dc7a93f3-671d-45dc-a813-d6a0f3e9ee00]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sa-dbaac-portal: Refreshing state... [id=fbd24123-a79f-49f8-96b4-5f4b1866bbd0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.realm-management_manage-users_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/f3622592-630f-490c-82c0-f7fb1d3cd4d1]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_query-groups_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/bd9c60ca-63fa-4bf8-ab51-935ae4ca0d12]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-hscis: Refreshing state... [id=fc5ce74b-a15b-46c5-8eb1-1d88d19f1d4d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-groups: Refreshing state... [id=2e4a2cc3-bcd3-461b-9b5a-90d928f6f385]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_view-events_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/e7803d5a-b7e1-48bc-b8cb-f465c3a09e11]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_manage-user-details: Refreshing state... [id=1ba3bbcb-d2db-4cb3-be33-2f88062e0dac]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-fmdb: Refreshing state... [id=dde08fa7-a99f-4e62-9d57-c9d83a283e2f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-uci-sso: Refreshing state... [id=17213d47-65a1-41e0-96bd-5b90878e33cf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.realm-management_view-events_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/e7803d5a-b7e1-48bc-b8cb-f465c3a09e11]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_query-clients_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/644d3737-bff6-419d-97c5-fef873aa2483]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm-management-manage-users_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/f3622592-630f-490c-82c0-f7fb1d3cd4d1]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-events: Refreshing state... [id=a43ca1ce-6e81-4dc3-9961-07f4d2cc7b70]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-miwt: Refreshing state... [id=1214235c-6f1c-4376-9c5f-b7155b020594]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sa-hibc-service-bc-portal: Refreshing state... [id=95bb3b2c-8e55-461d-9f7d-cd3580d14a0b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-plr: Refreshing state... [id=d9c10e7f-f9ad-4d47-95ea-c1b0c801098b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_manage-user-groups: Refreshing state... [id=08b61790-4b8e-4518-bb58-1e7acb26903b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-users: Refreshing state... [id=beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-bcer-cp: Refreshing state... [id=484562a0-650d-4910-a371-c5ccec29487d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-pidp-service: Refreshing state... [id=8f6a5f08-bd8c-41b4-83a3-6c08553ac98f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-hamis: Refreshing state... [id=671cf55c-acc5-4902-bf07-6cd79f910178]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-eacl: Refreshing state... [id=aaf1d410-329c-4f6b-93e0-c34b0f676bcf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-metrics: Refreshing state... [id=3e1fb43e-a04d-43a4-9035-a24fe363b76a]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_create-user: Refreshing state... [id=2ea1ec2c-1603-46a2-a348-6d0c7ce559da]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-clients: Refreshing state... [id=8742c7c0-664c-4321-8225-f70420d299f7]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sa-sfdc: Refreshing state... [id=6fc8a0df-3e8c-4ac1-9c5a-c9f9a5c1cf44]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sat-case-management-1: Refreshing state... [id=d907359b-e14a-4b06-b5af-036e98403810]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-hcimweb: Refreshing state... [id=5f854e07-fe45-497c-85e3-a3551b88ac66]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-maid-case-management-1: Refreshing state... [id=c3b946cc-a05a-498d-b57f-55bc52c71e11]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sfds: Refreshing state... [id=80baf2c1-8406-4bc5-bfee-01ca82e07db5]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-sat-drug-management-1: Refreshing state... [id=0967e9dd-54fa-42db-a8fa-794b2cb8f9d8]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-mspdirect-service: Refreshing state... [id=03bd41b3-3d95-4f72-a454-0a8349e53584]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-hem: Refreshing state... [id=e27ac762-003b-45dc-95ed-7004979d6411]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-webcaps: Refreshing state... [id=05df8cc9-8db5-4a9b-bdae-09b9e8708fb0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-gis: Refreshing state... [id=631d7ff0-b506-4152-b099-2493591b8300]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-maid: Refreshing state... [id=ee519aeb-df4c-4bb9-85a4-3aff2ac3bfb7]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-emcod: Refreshing state... [id=4dbb943e-038c-4112-b079-d4043849925b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_manage-user-roles: Refreshing state... [id=f539f4bf-ba7a-4ba3-a8d4-a47f786e205d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_role.UMS_role_view-client-swt: Refreshing state... [id=b2796d70-cca6-47d1-845c-2411b3671b33]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sa-dbaac-portal_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/fbd24123-a79f-49f8-96b4-5f4b1866bbd0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sa-dbaac-portal_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/fbd24123-a79f-49f8-96b4-5f4b1866bbd0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-hscis_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/fc5ce74b-a15b-46c5-8eb1-1d88d19f1d4d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-hscis_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/fc5ce74b-a15b-46c5-8eb1-1d88d19f1d4d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-groups_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/2e4a2cc3-bcd3-461b-9b5a-90d928f6f385]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-groups_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/2e4a2cc3-bcd3-461b-9b5a-90d928f6f385]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_manage-user-details_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/1ba3bbcb-d2db-4cb3-be33-2f88062e0dac]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_manage-user-details_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/1ba3bbcb-d2db-4cb3-be33-2f88062e0dac]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_view-clients_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/25f8cbcd-74fa-4f55-bfc7-2e6bbcbe84ad]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.realm-management_view-clients_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/25f8cbcd-74fa-4f55-bfc7-2e6bbcbe84ad]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.realm-management_view-users_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/d50255df-43b4-4b05-9439-72c953ecbbda]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.ums_realm_management_view-users_client_role_mapper: Refreshing state... [id=moh_applications/client/2ddc7173-34f3-41ff-9beb-66c7802717ce/scope-mappings/1b2ce61a-1235-4a0e-8334-1ac557151757/d50255df-43b4-4b05-9439-72c953ecbbda]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-fmdb_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/dde08fa7-a99f-4e62-9d57-c9d83a283e2f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-fmdb_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/dde08fa7-a99f-4e62-9d57-c9d83a283e2f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.PIDP-SERVICE_view-client-uci-sso_service_account_role: Refreshing state... [id=9ab20ecc-c39f-45d4-992c-8290579a247d/17213d47-65a1-41e0-96bd-5b90878e33cf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.PIDP-SERVICE_ums_view-client-uci-sso_client_role_mapper: Refreshing state... [id=moh_applications/client/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/17213d47-65a1-41e0-96bd-5b90878e33cf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-events_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/a43ca1ce-6e81-4dc3-9961-07f4d2cc7b70]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-events_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/a43ca1ce-6e81-4dc3-9961-07f4d2cc7b70]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-miwt_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/1214235c-6f1c-4376-9c5f-b7155b020594]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-miwt_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/1214235c-6f1c-4376-9c5f-b7155b020594]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sa-hibc-service-bc-portal_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/95bb3b2c-8e55-461d-9f7d-cd3580d14a0b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sa-hibc-service-bc-portal_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/95bb3b2c-8e55-461d-9f7d-cd3580d14a0b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-plr_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/d9c10e7f-f9ad-4d47-95ea-c1b0c801098b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-plr_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/d9c10e7f-f9ad-4d47-95ea-c1b0c801098b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_manage-user-groups_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/08b61790-4b8e-4518-bb58-1e7acb26903b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_manage-user-groups_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/08b61790-4b8e-4518-bb58-1e7acb26903b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-users_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-users_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-pidp-service_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/8f6a5f08-bd8c-41b4-83a3-6c08553ac98f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-pidp-service_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/8f6a5f08-bd8c-41b4-83a3-6c08553ac98f]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-bcer-cp_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/484562a0-650d-4910-a371-c5ccec29487d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-bcer-cp_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/484562a0-650d-4910-a371-c5ccec29487d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-hamis_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/671cf55c-acc5-4902-bf07-6cd79f910178]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-hamis_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/671cf55c-acc5-4902-bf07-6cd79f910178]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-eacl_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/aaf1d410-329c-4f6b-93e0-c34b0f676bcf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-eacl_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/aaf1d410-329c-4f6b-93e0-c34b0f676bcf]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-metrics_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/3e1fb43e-a04d-43a4-9035-a24fe363b76a]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_create-user_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/2ea1ec2c-1603-46a2-a348-6d0c7ce559da]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_create-user_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/2ea1ec2c-1603-46a2-a348-6d0c7ce559da]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-clients_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/8742c7c0-664c-4321-8225-f70420d299f7]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-clients_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/8742c7c0-664c-4321-8225-f70420d299f7]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sa-sfdc_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/6fc8a0df-3e8c-4ac1-9c5a-c9f9a5c1cf44]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sat-case-management-1_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/d907359b-e14a-4b06-b5af-036e98403810]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sa-sfdc_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/6fc8a0df-3e8c-4ac1-9c5a-c9f9a5c1cf44]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sat-case-management-1_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/d907359b-e14a-4b06-b5af-036e98403810]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sfds_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/80baf2c1-8406-4bc5-bfee-01ca82e07db5]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sfds_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/80baf2c1-8406-4bc5-bfee-01ca82e07db5]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-hcimweb_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/5f854e07-fe45-497c-85e3-a3551b88ac66]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-hcimweb_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/5f854e07-fe45-497c-85e3-a3551b88ac66]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-maid-case-management-1_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/c3b946cc-a05a-498d-b57f-55bc52c71e11]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-maid-case-management-1_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/c3b946cc-a05a-498d-b57f-55bc52c71e11]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-sat-drug-management-1_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/0967e9dd-54fa-42db-a8fa-794b2cb8f9d8]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-sat-drug-management-1_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/0967e9dd-54fa-42db-a8fa-794b2cb8f9d8]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-mspdirect-service_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/03bd41b3-3d95-4f72-a454-0a8349e53584]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-mspdirect-service_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/03bd41b3-3d95-4f72-a454-0a8349e53584]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-webcaps_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/05df8cc9-8db5-4a9b-bdae-09b9e8708fb0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-webcaps_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/05df8cc9-8db5-4a9b-bdae-09b9e8708fb0]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-hem_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/e27ac762-003b-45dc-95ed-7004979d6411]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-hem_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/e27ac762-003b-45dc-95ed-7004979d6411]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-gis_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/631d7ff0-b506-4152-b099-2493591b8300]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-gis_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/631d7ff0-b506-4152-b099-2493591b8300]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-maid_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/ee519aeb-df4c-4bb9-85a4-3aff2ac3bfb7]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-emcod_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/4dbb943e-038c-4112-b079-d4043849925b]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_view-client-swt_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/b2796d70-cca6-47d1-845c-2411b3671b33]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_manage-user-roles_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/f539f4bf-ba7a-4ba3-a8d4-a47f786e205d]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_generic_client_role_mapper.umc_ums_view-client-swt_client_role_mapper: Refreshing state... [id=moh_applications/client/0ac8e30e-28cb-4545-bd7f-dc4a195661b2/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/b2796d70-cca6-47d1-845c-2411b3671b33]
module.KEYCLOAK_DEV.module.moh_applications.keycloak_openid_client_service_account_role.UMS_manage-user-roles_service_account_role: Refreshing state... [id=7c5ddf30-1754-490b-ae43-ba71cd544e6b/f539f4bf-ba7a-4ba3-a8d4-a47f786e205d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.keycloak_openid_user_session_note_protocol_mapper.IDP will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "IDP" {
      + add_to_access_token = true
      + add_to_id_token     = false
      + claim_name          = "identity_provider"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "IDP"
      + realm_id            = "moh_applications"
      + session_note        = "identity_provider"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FMDB.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + base_url                                  = "https://fmdbt.hlth.gov.bc.ca/FMDB"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "FMDB"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Formulary Management Database v3"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "FMDB"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://fmdbt.hlth.gov.bc.ca/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FMDB.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "fmdb_role"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "FMDB"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Role mapper"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FMDB.keycloak_role.ROLES["MOHUSER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "The base user permission for FMDB"
      + id          = (known after apply)
      + name        = "MOHUSER"
      + realm_id    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FMDB.keycloak_role.ROLES["PSDADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Admin role for FMDB provides access to code table management"
      + id          = (known after apply)
      + name        = "PSDADMIN"
      + realm_id    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + base_url                                  = "https://miwtuat.hlth.gov.bc.ca/MedicalImaging"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "MIWT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Medical Imaging Wait Times"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "MIWT"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://miwtuat.hlth.gov.bc.ca/*",
          + "https://sts.healthbc.org/adfs/ls/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "miwt_role"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "MIWT"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Role mapper"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_FRASER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_FRASER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_INTERIOR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_INTERIOR"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_NORTHERN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_NORTHERN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_PHSA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_PHSA"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_VAN_COSTL"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_VAN_COSTL"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMGA_HA_VAN_ISLD"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_VAN_ISLD"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT.keycloak_role.ROLES["MEDIMSTAFF"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMSTAFF"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + base_url                                  = "https://miwtstg.hlth.gov.bc.ca/MedicalImaging"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "MIWT_STG"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Medical Imaging Wait Times"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "MIWT_STG"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://miwtstg.hlth.gov.bc.ca/*",
          + "https://sts.healthbc.org/adfs/ls/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "miwt_role"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "MIWT_STG"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Role mapper"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_FRASER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_FRASER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_INTERIOR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_INTERIOR"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_NORTHERN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_NORTHERN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_PHSA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_PHSA"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_VAN_COSTL"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_VAN_COSTL"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMGA_HA_VAN_ISLD"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_VAN_ISLD"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MIWT_STG.keycloak_role.ROLES["MEDIMSTAFF"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MEDIMSTAFF"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.MIWT.module.payara_client.keycloak_role.ROLES["MEDIMGA_HA_VAN_ISLD"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "38c5393f-a736-4ee3-a952-477e3308f802"
      + id        = (known after apply)
      + name      = "MEDIMGA_HA_VAN_ISLD"
      + realm_id  = "moh_applications"
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vangeliq, Action: `pull_request`*